DataProcessors/xddDataDumper.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>xddDataDumper</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПустыеТаблицы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыКонфигурации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьОткорректированныйЗапрос</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/xddDataDumper/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСписокОбъектовКонфигурацииНаСервере()
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	ЭтаОбработка.ОбновитьСписокОбъектов();
	ЗначениеВРеквизитФормы(ЭтаОбработка, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОбъектовКонфигурации(Команда)
	ОбновитьСписокОбъектовКонфигурацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	
	Конструктор = Новый КонструкторЗапроса; 
	Конструктор.Текст = Элементы.ОбъектыКонфигурации.ТекущиеДанные.Запрос; 
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение", ЭтотОбъект, Элементы.ОбъектыКонфигурации.ТекущаяСтрока); 
	Конструктор.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт 
	
	ИдентификаторСтроки = ДополнительныеПараметры;
	ТЗОбъект = Объект.ОбъектыКонфигурации;
	Если ИдентификаторСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = ТЗОбъект.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Конструктор = Новый КонструкторЗапроса; 
	Конструктор.Текст = Строка.Запрос;
	Если Конструктор.Текст = Текст Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Запрос = Текст;
	Строка.ИспользоватьОткорректированныйЗапрос = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьМакетИзЗапросаНаСервере(ТекстЗапроса)
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = ЭтаОбработка.СгенерироватьМакетИзЗапроса(ТекстЗапроса);
	ТабличныйДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМакетИзЗапроса(Команда)
	ПолучитьМакетИзЗапросаНаСервере(Элементы.ОбъектыКонфигурации.ТекущиеДанные.Запрос);
КонецПроцедуры
